20-topics/emacs-org/index.org
#+title: Emacs org

* org mode 学习总索引

** 学习目标
- 理解 org mode 的核心设计
- 熟练使用 TODO / Agenda 进行任务管理
- 能用org 组织知识
- 掌握代码块(Babel) 进行可执行文档
- 构建自己的长期知识库


** 当前阶段
:PROPERTIES:
:LEVEL: Beginner
:STARTED: 2026-04-08
:END:
:END:

当前状态：

- 正在学习基本语法
- 尚未进入 Agenda / Capture / Babel


** 当前问题

- [ ] 不理解 org 的核心模型（只是觉得像 markdown）
- [ ] 不清楚 Agenda 的工作机制
- [ ] 不知道如何组织文件结构
- [ ] 不熟悉快捷键


** 学习路径

*** Phase 1: 基础结构
- [X] 标题
- [X] 列表
- [ ] TODO 系统
- [ ] 标签
- [ ] 属性


*** Phase 2: 任务管理
- [ ] Agenda (C-c a)
- [ ] Deadline / Scheduled
- [ ] 优先级
- [ ] 过滤 / 视图


*** Phase 3: 笔记系统
- [ ] 内部链接
- [ ] ID / 引用
- [ ] org-roam


*** Phase 4: 高级能力
- [ ] 代码块
- [ ] Babel 执行
- [ ] 导出
- [ ] 表格系统

-----

** 待做列表

*** Basics 待做列表

**** DONE 学习标题与折叠
SCHEDULED: <2026-04-08 三>

说明：理解 Org 是一个 outline system

**** DONE 学习基本快捷键
SCHEDULED: <2026-04-08 三>


- C-c C-t 切换TODO状态
- TAB 折叠/展开
- M-RET 新建同级目录


**** DONE 能力A: 自己写出一个结构化文档
SCHEDULED: <2026-04-09 四>

- [X] 能写出多级 headline 结构
- [X] 能区分 headline 与普通文本
- [X] 不再写 “平铺文档”


**** DONE 能力B: 可见性切换(visibility cycling)
SCHEDULED: <2026-04-09 四>

- [X] 使用 TAB 折叠/展开子树
- [X] 使用 S-TAB 在全局视图切换
- [X] 能快速聚焦当前节点


**** DONE 能力C: 结构编辑
SCHEDULED: <2026-04-09 四>

- [X] 使用 M-up / M-down 移动 subtree
- [X] 使用 M-left / M-right 提升/降级标题
- [X] 不再手动剪切粘贴结构块


**** TODO 能力D: 结构区分能力
SCHEDULED: <2026-04-09 四>

- [ ] 能使用 properties drawer
- [X] 能区分 headline / list / 正文


**** TODO 阅读顺序
SCHEDULED: <2026-04-10 五>

1. Introduction / Summary
2. Document Structure
3. Headlines
4. Visibility Cycling
5. Motion
6. Structure Editing
7. Plain Lists
8. Drawers



** 参考资料
- [[https://orgmode.org/manual][官方文档]]
- Emacs 内置文档: C-h i -> Org Mode



