20-topics/emacs-org/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-08 三 13:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs org</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs org</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org78694d5">1. org mode 学习总索引</a>
<ul>
<li><a href="#org9780c99">1.1. 学习目标</a></li>
<li><a href="#org5e9dd79">1.2. 当前阶段</a></li>
<li><a href="#org1cdd707">1.3. 当前问题</a></li>
<li><a href="#org48f2a31">1.4. 学习路径</a>
<ul>
<li><a href="#org6aa5b92">1.4.1. Phase 1: 基础结构</a></li>
<li><a href="#org5edf691">1.4.2. Phase 2: 任务管理</a></li>
<li><a href="#org6a19a4f">1.4.3. Phase 3: 笔记系统</a></li>
<li><a href="#org86977a6">1.4.4. Phase 4: 高级能力</a></li>
</ul>
</li>
<li><a href="#org5c506ce">1.5. 待做列表</a>
<ul>
<li><a href="#org08d95ef">1.5.1. Basics 待做列表</a></li>
</ul>
</li>
<li><a href="#org15bd721">1.6. 参考资料</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org78694d5" class="outline-2">
<h2 id="org78694d5"><span class="section-number-2">1.</span> org mode 学习总索引</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9780c99" class="outline-3">
<h3 id="org9780c99"><span class="section-number-3">1.1.</span> 学习目标</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>理解 org mode 的核心设计</li>
<li>熟练使用 TODO / Agenda 进行任务管理</li>
<li>能用org 组织知识</li>
<li>掌握代码块(Babel) 进行可执行文档</li>
<li>构建自己的长期知识库</li>
</ul>
</div>
</div>
<div id="outline-container-org5e9dd79" class="outline-3">
<h3 id="org5e9dd79"><span class="section-number-3">1.2.</span> 当前阶段</h3>
<div class="outline-text-3" id="text-1-2">
<p>
:END:
</p>

<p>
当前状态：
</p>

<ul class="org-ul">
<li>正在学习基本语法</li>
<li>尚未进入 Agenda / Capture / Babel</li>
</ul>
</div>
</div>
<div id="outline-container-org1cdd707" class="outline-3">
<h3 id="org1cdd707"><span class="section-number-3">1.3.</span> 当前问题</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> 不理解 org 的核心模型（只是觉得像 markdown）</li>
<li class="off"><code>[&#xa0;]</code> 不清楚 Agenda 的工作机制</li>
<li class="off"><code>[&#xa0;]</code> 不知道如何组织文件结构</li>
<li class="off"><code>[&#xa0;]</code> 不熟悉快捷键</li>
</ul>
</div>
</div>
<div id="outline-container-org48f2a31" class="outline-3">
<h3 id="org48f2a31"><span class="section-number-3">1.4.</span> 学习路径</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org6aa5b92" class="outline-4">
<h4 id="org6aa5b92"><span class="section-number-4">1.4.1.</span> Phase 1: 基础结构</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> 标题</li>
<li class="on"><code>[X]</code> 列表</li>
<li class="off"><code>[&#xa0;]</code> TODO 系统</li>
<li class="off"><code>[&#xa0;]</code> 标签</li>
<li class="off"><code>[&#xa0;]</code> 属性</li>
</ul>
</div>
</div>
<div id="outline-container-org5edf691" class="outline-4">
<h4 id="org5edf691"><span class="section-number-4">1.4.2.</span> Phase 2: 任务管理</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Agenda (C-c a)</li>
<li class="off"><code>[&#xa0;]</code> Deadline / Scheduled</li>
<li class="off"><code>[&#xa0;]</code> 优先级</li>
<li class="off"><code>[&#xa0;]</code> 过滤 / 视图</li>
</ul>
</div>
</div>
<div id="outline-container-org6a19a4f" class="outline-4">
<h4 id="org6a19a4f"><span class="section-number-4">1.4.3.</span> Phase 3: 笔记系统</h4>
<div class="outline-text-4" id="text-1-4-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> 内部链接</li>
<li class="off"><code>[&#xa0;]</code> ID / 引用</li>
<li class="off"><code>[&#xa0;]</code> org-roam</li>
</ul>
</div>
</div>
<div id="outline-container-org86977a6" class="outline-4">
<h4 id="org86977a6"><span class="section-number-4">1.4.4.</span> Phase 4: 高级能力</h4>
<div class="outline-text-4" id="text-1-4-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> 代码块</li>
<li class="off"><code>[&#xa0;]</code> Babel 执行</li>
<li class="off"><code>[&#xa0;]</code> 导出</li>
<li class="off"><code>[&#xa0;]</code> 表格系统</li>
</ul>

<hr />
</div>
</div>
</div>
<div id="outline-container-org5c506ce" class="outline-3">
<h3 id="org5c506ce"><span class="section-number-3">1.5.</span> 待做列表</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org08d95ef" class="outline-4">
<h4 id="org08d95ef"><span class="section-number-4">1.5.1.</span> Basics 待做列表</h4>
<div class="outline-text-4" id="text-1-5-1">
</div>
<ol class="org-ol">
<li><a id="org545e26b"></a><span class="done DONE">DONE</span> 学习标题与折叠<br />
<div class="outline-text-5" id="text-1-5-1-1">
<p>
说明：理解 Org 是一个 outline system
</p>
</div>
</li>
<li><a id="org2fb634b"></a><span class="done DONE">DONE</span> 学习基本快捷键<br />
<div class="outline-text-5" id="text-1-5-1-2">
<ul class="org-ul">
<li>C-c C-t 切换TODO状态</li>
<li>TAB 折叠/展开</li>
<li>M-RET 新建同级目录</li>
</ul>
</div>
</li>
<li><a id="orga4bff89"></a><span class="done DONE">DONE</span> 能力A: 自己写出一个结构化文档<br />
<div class="outline-text-5" id="text-1-5-1-3">
<ul class="org-ul">
<li class="on"><code>[X]</code> 能写出多级 headline 结构</li>
<li class="on"><code>[X]</code> 能区分 headline 与普通文本</li>
<li class="on"><code>[X]</code> 不再写 “平铺文档”</li>
</ul>
</div>
</li>
<li><a id="org814941b"></a><span class="done DONE">DONE</span> 能力B: 可见性切换(visibility cycling)<br />
<div class="outline-text-5" id="text-1-5-1-4">
<ul class="org-ul">
<li class="on"><code>[X]</code> 使用 TAB 折叠/展开子树</li>
<li class="on"><code>[X]</code> 使用 S-TAB 在全局视图切换</li>
<li class="on"><code>[X]</code> 能快速聚焦当前节点</li>
</ul>
</div>
</li>
<li><a id="orgb1b3a8f"></a><span class="done DONE">DONE</span> 能力C: 结构编辑<br />
<div class="outline-text-5" id="text-1-5-1-5">
<ul class="org-ul">
<li class="on"><code>[X]</code> 使用 M-up / M-down 移动 subtree</li>
<li class="on"><code>[X]</code> 使用 M-left / M-right 提升/降级标题</li>
<li class="on"><code>[X]</code> 不再手动剪切粘贴结构块</li>
</ul>
</div>
</li>
<li><a id="orgde17373"></a><span class="todo TODO">TODO</span> 能力D: 结构区分能力<br />
<div class="outline-text-5" id="text-1-5-1-6">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> 能使用 properties drawer</li>
<li class="on"><code>[X]</code> 能区分 headline / list / 正文</li>
</ul>
</div>
</li>
<li><a id="org0909ddb"></a><span class="todo TODO">TODO</span> 阅读顺序<br />
<div class="outline-text-5" id="text-1-5-1-7">
<ol class="org-ol">
<li>Introduction / Summary</li>
<li>Document Structure</li>
<li>Headlines</li>
<li>Visibility Cycling</li>
<li>Motion</li>
<li>Structure Editing</li>
<li>Plain Lists</li>
<li>Drawers</li>
</ol>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org15bd721" class="outline-3">
<h3 id="org15bd721"><span class="section-number-3">1.6.</span> 参考资料</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li><a href="https://orgmode.org/manual">官方文档</a></li>
<li>Emacs 内置文档: C-h i -&gt; Org Mode</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2026-04-08 三 13:25</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
